JiaHeWG/RM-STM32-A90-Project/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Onboard_LED_Pin GPIO_PIN_13
#define Onboard_LED_GPIO_Port GPIOC
#define DIS_A_Pin GPIO_PIN_0
#define DIS_A_GPIO_Port GPIOA
#define DIS_B_Pin GPIO_PIN_1
#define DIS_B_GPIO_Port GPIOA
#define DIS_C_Pin GPIO_PIN_2
#define DIS_C_GPIO_Port GPIOA
#define DIS_D_Pin GPIO_PIN_3
#define DIS_D_GPIO_Port GPIOA
#define DIS_E_Pin GPIO_PIN_4
#define DIS_E_GPIO_Port GPIOA
#define DIS_F_Pin GPIO_PIN_5
#define DIS_F_GPIO_Port GPIOA
#define DIS_G_Pin GPIO_PIN_6
#define DIS_G_GPIO_Port GPIOA
#define DIS_DP_Pin GPIO_PIN_7
#define DIS_DP_GPIO_Port GPIOA
#define Onboard_Buzzer_Pin GPIO_PIN_0
#define Onboard_Buzzer_GPIO_Port GPIOB
#define Onboard_Button_Pin GPIO_PIN_15
#define Onboard_Button_GPIO_Port GPIOA
#define L298N_IN1_Pin GPIO_PIN_6
#define L298N_IN1_GPIO_Port GPIOB
#define L298N_IN2_Pin GPIO_PIN_7
#define L298N_IN2_GPIO_Port GPIOB
#define L298N_IN3_Pin GPIO_PIN_8
#define L298N_IN3_GPIO_Port GPIOB
#define L298N_IN4_Pin GPIO_PIN_9
#define L298N_IN4_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
